#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
//浮点数在内存中的存储
int main()
{
	int a = 9;
	float* pa = (float*)&a;
	printf("%d\n", a);
	printf("%f\n", *pa);
	*pa = 9.0;
	printf("%d\n", a);
	printf("%f\n", *pa);
	return 0;
}
//浮点数的表达形式
//（-1）^s*M*2^E
//(-1)^s表示符号位
//M是有效数字
//2^E是指数位
//9.0
// 1001.0
//可以写为(-1)^0*1.001*2^3
//所以只需要存储sME就可
//单精度浮点型
//s(1bit)+E(8bit)+M(23bit)
//双精度浮点型
//s(1bit)+E(11bit)+M(52bit)
//s 正数为0 负数为1
//E 单精度加上127剩余补零 双精度加上2047剩余补零(要化成二进制)
//M 取小数点后面的数 剩余补零
//9.0 s 0,E 3,M 001
//130 --10000010
//即0 10000010 00100000000000000000000
//换成十进制